# StructuralConnectionInputElements Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralConnectionInputElements Property
ParameterTypeId Class See Also
---
"Input Elements"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralConnectionInputElements { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionInputElements As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralConnectionInputElements {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace